In [11]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from statistics import *

In [110]:
# Q1. Problem Statement: Measures of Central Tendency- I
# Write a Python program to declare a 1-D array. With the help of the statistics
# library, calculate the Mean, Median, and Mode.
# Note: You can write any data of your choice inside the array
x = [ 1, 2, 3, 4, 5, 6, 2, 3, 4, 5, 5, 5, 5]
y = np.array(x)
# print(y)
print(mean(y))
print(median(y))
print(mode(y))

3
4
5

In [23]:
# import pandas as pd

# # Create a list of lists containing the data
# data = [
#     ["Bag1", 10, 20, 30, 40],
#     ["Bag2", 7, 14, 21, 28],
#     ["Bag3", 55, 15, 8, 12],
#     ["Bag4", 15, 14, 1, 8],
#     ["Bag5", 7, 1, 1, 8],
#     ["Bag6", 5, 4, 9, 2]
# ]

# # Create a Pandas DataFrame from the list of lists
# df = pd.DataFrame(data, columns=["Bag", "Apple", "Orange", "Banana", "Pear"])

# print(df)

# Q2. Problem Statement: Measures of Central Tendency- II
# Write a Python program to declare a DataFrame as shown in the dataset section
# below and calculate the Mean, Median, and Mode of the entire DataFrame.
# Note: You can write any data of your choice inside the DataFrame


data = { "Apple" : [10,7,55,15,7,5],
        "Orange" : [20,14,15,14,1,4],
        "Banana" : [30,21,8,1,1,9],
        "Pear" : [40,28,12,8,8,2]}
bags = ["bag1","bag2","bag3","bag4","bag5","bag6"]

df = pd.DataFrame(data, index=bags)
df

      Apple  Orange  Banana  Pear
bag1     10      20      30    40
bag2      7      14      21    28
bag3     55      15       8    12
bag4     15      14       1     8
bag5      7       1       1     8
bag6      5       4       9     2

In [31]:
df.mean()

Apple     16.500000
Orange    11.333333
Banana    11.666667
Pear      16.333333
dtype: float64

In [35]:
df.median()

Apple      8.5
Orange    14.0
Banana     8.5
Pear      10.0
dtype: float64

In [37]:
df.mode()

   Apple  Orange  Banana  Pear
0      7      14       1     8

In [45]:
# Q3. Problem Statement: Measures of Central Tendency- III
# Load the “Books.csv” dataset into a DataFrame and perform the following tasks:
# 1. Perform initial analysis on the dataset using the info() and the
# describe() functions
# 2. Group the data based on the "Author" column and calculate the average user
# ratings and average price, and write them in new columns
# 3. Find out which of the authors have written the maximum number of books 

Book = pd.read_csv("Books.csv")
Book.head()

,Name,Author,User Rating,Reviews,Price,Year,Genre
0,"Act Like a Lady, Think Like a Man: What Men Re...",Steve Harvey,4.6,5013,17,2009,Non Fiction
1,Arguing with Idiots: How to Stop Small Minds a...,Glenn Beck,4.6,798,5,2009,Non Fiction
2,"Breaking Dawn (The Twilight Saga, Book 4)",Stephenie Meyer,4.6,9769,13,2009,Fiction
3,Crazy Love: Overwhelmed by a Relentless God,Francis Chan,4.7,1542,14,2009,Non Fiction
4,Dead And Gone: A Sookie Stackhouse Novel (Sook...,Charlaine Harris,4.6,1541,4,2009,Fiction

In [47]:
Book.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         700 non-null    object
 1   Author       700 non-null    object
 2   User Rating  700 non-null    float64
 3   Reviews      700 non-null    int64
 4   Price        700 non-null    int64
 5   Year         700 non-null    int64
 6   Genre        700 non-null    object
dtypes: float64(1), int64(3), object(3)
memory usage: 38.4+ KB

In [51]:
Book.describe()

       User Rating        Reviews       Price         Year
count   700.000000     700.000000  700.000000   700.000000
mean      4.639857   19255.195714   12.700000  2015.500000
std       0.218586   23613.443875    9.915162     4.034011
min       3.300000      37.000000    0.000000  2009.000000
25%       4.500000    4987.250000    7.000000  2012.000000
50%       4.700000   10284.000000   11.000000  2015.500000
75%       4.800000   23358.000000   15.000000  2019.000000
max       4.900000  208917.000000  105.000000  2022.000000

In [66]:
author_group = Book.groupby("Author").agg( author_rating = ("User Rating", 'mean'), price_author = ("Price", "mean")).reset_index()
print(author_group)

                 Author  author_rating  price_author
0      Abraham Verghese            4.6     11.000000
1        Adam Gasiewski            4.4      6.000000
2         Adam Mansbach            4.8      9.000000
3          Adam Silvera            4.7      8.000000
4          Adam Wallace            4.8      6.250000
..                  ...            ...           ...
300    William P. Young            4.6      8.000000
301    Wizards RPG Team            4.8     27.000000
302  Wonder House Books            4.6     16.000000
303  Workman Publishing            4.8      7.666667
304        Zhi Gang Sha            4.6     11.500000

[305 rows x 3 columns]

In [112]:
author_count = Book["Author"].value_counts().reset_index()
print(author_count)
max_book = author_count["count"].max()
author_max = author_count[author_count["count"] == max_book]
print("Authors with maximum books" , author_max)
# max_books = author_count['Author'].max()
# authors_with_max_books = author_count[author_count['Author'] == max_books]

# # Display the authors with the maximum number of books
# print(authors_with_max_books)
# author_count["Author"].max()

                                 Author  count
0                           Jeff Kinney     14
1                          Gary Chapman     14
2                       Suzanne Collins     12
3                          Rick Riordan     11
4    American Psychological Association     11
..                                  ...    ...
300                      Randall Munroe      1
301           Coloring Books for Adults      1
302                          Chris Kyle      1
303                         Angie Grace      1
304                     Stephen Perrine      1

[305 rows x 2 columns]
Authors with maximum books          Author  count
0   Jeff Kinney     14
1  Gary Chapman     14